# Максимальная группа
# Назовём набор различных натуральных чисел группой. Например: (13,4,22,40). Тогда длиной группы будем считать
# количество чисел в группе. Например, длина группы (13,4,22,40) равна 4.
#
# Дана последовательность натуральных чисел от 1 до n включительно. Напишите программу, которая группирует все числа
# данной последовательности по сумме их цифр и определяет длину группы, содержащей наибольшее количество чисел.


def max_group(n: int):
    dct = {}
    for i in range(1, n + 1):
        temp = 0 # аккумулятор для текущего числа
        i = str(i) # преобразовали в строку для посимвольной итерации
        for x in i: # проходим строку посимвольно
            temp += int(x)
        if temp in dct:
            dct[temp] += 1
        else:
            dct[temp] = 1
    return max(dct.values()) if dct else None

test = [13, 2, 0, 20]

for argument in test:
    print(max_group(argument))