# Тимур, Артур и новый курс
# Сегодня Тимур ждёт в гости своего друга Артура, чтобы спланировать работу по новому курсу "ООП на Python". Чтобы
# подготовиться к встрече, Тимуру необходимо посетить два магазина, расположенных рядом с его домом. От дома до первого
# магазина ведёт дорожка длиной d1 метров, а до второго магазина ведёт дорожка длиной d2 метров. Также существует
# дорожка, соединяющая два магазина друг с другом, длиной d3 метров.
#
# Напишите программу, которая вычисляет минимальное расстояние, которое потребуется пройти Тимуру, чтобы посетить оба
# магазина и вернуться домой. Тимур всегда стартует из дома. Он должен посетить оба магазина, перемещаясь только по
# имеющимся трём дорожкам, и вернуться назад домой. При этом его совершенно не смутит, если ему придётся посетить один
# и тот же магазин или пройти по одной и той же дорожке более одного раза. Единственная его задача — минимизировать
# суммарное пройденное расстояние.

def calc_distance(d1_home_and_1st_shop: int, d2_home_and_2nd_shop: int, d3_distance_between_shops: int) -> int:
    temp_min = min(d1_home_and_1st_shop, d2_home_and_2nd_shop) # узнаем расстояние до ближайшего магазина
    temp_max = max(d1_home_and_1st_shop, d2_home_and_2nd_shop) # узнаем расстояние до дальнего магазина
    option_1 = (temp_min  + temp_max) * 2 # рассматриваем случай дом - ближайший магазин - дом - второй магазин - дом
    option_2 = temp_min + d3_distance_between_shops + temp_max # дом - ближайший магазин - второй магазин - дом (по кругу)
    option_3 = (d3_distance_between_shops + temp_min) * 2 # дом - ближайший магазин - второй магазин - ближайший магазин - дом
    return min(option_1, option_2, option_3)

test = [(10,20,30),
        (10,10,45),
        (100,33,34),
        ]
for argument in test:
    print(calc_distance(*argument))