# Трудности перевода
# Зачастую переводить сериалы, не теряя изначальный смысл, невозможно, особенно за счет игр слов. Сумасшедший режиссер
# хочет снять сериал, в котором бы в целях эксперимента задействовал как можно больше языков, чтобы пользоваться
# красотой каждого из них. Тем не менее если задействовать слишком много языков, то сериал станет непонятен абсолютно
# всем, поэтому режиссер достает случайных людей на улице и спрашивает их, какие языки они знают, таким образом он
# будет использовать языки, которые знают все из них.
#
# Напишите программу, которая определяет, какие языки будут использоваться в сериале.

def translation(n: int, string: tuple[str, ...]) -> str:
    dct = {}
    for value in string:
        value = set(value.split(', ')) # преобразовали множество для устранения дубликатов в строке
        for language in value:
            if language in dct:
                dct[language] += 1
            else:
                dct[language] = 1
    temp = [key for key,value in dct.items() if value == n]
    return ', '.join(sorted(temp)) if temp else 'Сериал снять не удастся'

test_1 = [6,6]

test_2 = [('испанский, португальский, эсперанто, французский',
        'французский, испанский, эсперанто',
        'португальский, эсперанто, французский, испанский',
        'французский, английский, болгарский, испанский, эсперанто',
        'эсперанто, английский, русский, испанский, французский',
        'python, испанский, эсперанто, латышский, польский, французский'),
        ('испанский, португальский, эсперанто',
        'французский, испанский',
        'португальский, эсперанто, французский',
        'французский, английский, болгарский, испанский, эсперанто',
        'эсперанто, английский, русский, испанский, французский',
        'python, испанский, эсперанто, латышский, польский, французский'
         )]

for arg1, arg2 in zip(test_1,test_2):
    print(translation(arg1, arg2))