# Переворатор
# Дана последовательность натуральных чисел от 1 до n. Напишите программу, которая сначала располагает в обратном
# порядке часть элементов этой последовательности от элемента с номером X до элемента с номером Y, а затем от элемента
# с номером A до элемента с номером B.

def turn_over(n: int, x: int, y: int, a: int, b: int) -> list[int]:
    temp = list(range(1, n + 1)) # создали последовательность
    temp[x - 1: y] = temp[x - 1: y][::-1]
    temp[a - 1: b] = temp[a - 1: b][::-1]
    return temp

test = [(9, 2, 5, 6, 9),
        (9, 3, 6, 5, 8),
        (5, 1, 3, 4, 5),
        ]

for argument in test:
    print(*turn_over(*argument), sep = ', ')