# Функция likes()
# В различных социальных сетях существуют системы лайков, которые в зависимости от количества людей, оценивших запись,
# показывают соответствующую информацию.
#
# Реализуйте функцию likes(), которая принимает один аргумент:
#
# names — список имён
# Функция должна возвращать строку в соответствии с примерами ниже, содержание которой зависит от количества имён в
# списке names.
#
# Приведенный ниже код:
#
# print(likes([]))
# print(likes(['Тимур']))
# print(likes(['Тимур', 'Артур']))
# print(likes(['Тимур', 'Артур', 'Руслан']))
# print(likes(['Тимур', 'Артур', 'Руслан', 'Анри']))
# print(likes(['Тимур', 'Артур', 'Руслан', 'Анри', 'Дима']))
# print(likes(['Тимур', 'Артур', 'Руслан', 'Анри', 'Дима', 'Рома', 'Гвидо', 'Марк']))
# должен выводить:
#
# Никто не оценил данную запись
# Тимур оценил(а) данную запись
# Тимур и Артур оценили данную запись
# Тимур, Артур и Руслан оценили данную запись
# Тимур, Артур и 2 других оценили данную запись
# Тимур, Артур и 3 других оценили данную запись
# Тимур, Артур и 6 других оценили данную запись

def likes(names: tuple[str, ...]) -> str:
    temp = len(names)
    if temp == 1:
        result = f'{names[0]} оценил(а)'
    elif temp == 2:
        result = f'{names[0]} и {names[1]} оценили'
    elif temp == 3:
        result = f'{names[0]}, {names[1]} и {names[2]} других оценили'
    elif temp >= 4:
        result = f'{names[0]}, {names[1]} и {temp - 2} других оценили'
    else: # temp == 0
        result = f'Никто не оценил'
    return result + ' данную запись'

test = [(),
        ('Тимур',),
        ('Тимур', 'Артур'),
        ('Тимур', 'Артур', 'Руслан'),
        ('Тимур', 'Артур', 'Руслан', 'Анри'),
        ('Тимур', 'Артур', 'Руслан', 'Анри', 'Дима'),
        ('Тимур', 'Артур', 'Руслан', 'Анри', 'Дима', 'Рома', 'Гвидо', 'Марк'),
        ]

for argument in test:
    print(likes(argument))

