# Функция is_valid()
# Будем считать, что PIN-код является корректным, если он удовлетворяет следующим условиям:
#
# состоит из 4, 5 или 6 символов состоит только из цифр (0−9) не содержит пробелов
# Реализуйте функцию is_valid(), которая принимает один аргумент:
#
# string — произвольная строка
# Функция должна возвращать значение True, если строка string представляет собой корректный PIN-код, или False в
# противном случае.

def is_valid(string: str) -> bool:
    temp = ''
    for char in string:
        if char.isdigit():
            temp += char
        else:
            return False
    return len(temp) in [4,5,6] # проверили длину из списка допустимых значений

test = ['4367',
        '92134',
        '89abc1',
        '900876',
        '49 83',
        ]

for argument in test:
    print(is_valid(argument))