# Функция spell()
# Реализуйте функцию spell(), которая принимает произвольное количество позиционных аргументов-слов и возвращает
# словарь, ключи которого — первые буквы слов, а значения — максимальные длины слов на эту букву.

def spell(*args) -> dict[str,int]:
    my_dict = {}
    if args: # если кортеж НЕ пуст
        for value in args: # проходим кортеж
            value = value.lower() # меняем регистр всего слова на нижний
            if value[0] not in my_dict: # если первая буква еще не находится в словаре
                my_dict[value[0]] = len(value) # записываем первую букву как ключ, значение равно длине слова
            else: # если первая буква уже в словаре
                if my_dict[value[0]] < len(value): # если значение длины в словаре меньше чем то которое сейчас у слова
                    my_dict[value[0]] = len(value) # перезаписываем значение по ключу
        return my_dict
    else:
        return my_dict

test = [('россия', 'Австрия', 'австралия', 'РумыниЯ', 'Украина', 'КИТай', 'УЗБЕКИСТАН'),
        ('Математика', 'История', 'химия', 'биология', 'Информатика'),
        ('fruit', 'football', 'February', 'forest', 'Family'),
        ]

for argument in test:
    print(spell(*argument))